[
  {
    "name": "R. L. Wernli, \"AUVs-the maturity of the technology,\" Seattle, WA, USA, 1999.",
    "id": "Wernli_1999",
    "group": "Robot"
  },
  {
    "name": "N. Kato, \"Control performance in the horizontal plane of a fish robot with mechanical pectoral fins,\" IEEE Journal of Oceanic Engineering, vol. 25, pp. 121-129, 2000",
    "id": "Kato_2000",
    "group": "Robot"
  },
  {
    "name": "S. Saimek and P. Y. Li, \"Motion planning and control of a swimming machine,\" International Journal of Robotics Research, vol. 23, pp. 27- 53, 2004.",
    "id": "Saimek_Li_2004",
    "group": "Robot"
  },
  {
    "name": "M. A. MacIver, E. Fontaine, and J. W. Burdick, \"Designing future underwater vehicles: Principles and mechanisms of the weakly electric fish,\" IEEE Journal of Oceanic Engineering, vol. 29, pp. 651-659, 2004",
    "id": "MacIver_etal_2004",
    "group": "Robot"
  },
  {
    "name": "N. E. Leonard, \"Control synthesis and adaptation for an underactuated autonomous underwater vehicle,\" IEEE Journal of Oceanic Engineering, vol. 20, pp. 211-220, 1995",
    "id": "Leonard_1995",
    "group": "Robot"
  },
  {
    "name": "P. Y. Li and S. Saimek, \"Modeling and estimation of hydrodynamic potentials,\" in Proceedings of the IEEE Conference on Decision and Control, Phoenix, Arizona, USA, vol. 4, pp. 3253-3258, 1999.",
    "id": "Li_Saimek_1999",
    "group": "Misc"
  },
  {
    "name": "K. H. Low and A. Willy, \"Biomimetic motion planning of an undulating robotic fish fin,\" JVC/Journal of Vibration and Control, vol. 12, pp. 1337-1359, 2006.",
    "id": "Low_Willy_2006",
    "group": "Robot"
  },
  {
    "name": "How ships’ traffic noise affects whales in a shipping channel,\" May 2003",
    "id": "Unknown_2003",
    "group": "Misc"
  },
  {
    "name": "C. M. Breder, \"The locomotion of fishes,\" Zoologica, vol. 4, pp. 159-297, 1926",
    "id": "Breder_1929",
    "group": "Fish"
  },
  {
    "name": "C. C. Lindsey, Form, function and locomotory habits in fish, vol. VII Locomotion. New York: Academic Press, 1978.",
    "id": "Lindsey_1978",
    "group": "Fish"
  },
  {
    "name": "Y. Y. G. Taguchi, Y. Wu, Taguchi Methods: Design of Experiments: American Supplier Institute, 1993",
    "id": "Taguchi_Wu_1993",
    "group": "Misc"
  },
  {
    "name": "M. Sfakiotakis, D. M. Lane, and J. B. C. Davies, \"Review of fish swimming modes for aquatic locomotion,\" IEEE Journal of Oceanic Engineering, vol. 24, pp. 237-252, 1999.",
    "id": "Sfakiotakis_etal_1999",
    "group": "Fish"
  },
  {
    "name": "J. J. Magnuson, \"Locomotion by scombrid fishes: Hydromechanics, morphology and behavior,\" Fish Physiology, vol. 7, pp. 239-313, 1978",
    "id": "Magnuson_1978",
    "group": "Fish"
  },
  {
    "name": "Chong, C. W., Zhong, Y., Zhou, C. L., Low, K. H., Gerald Seet, G. L., & Lim, H. B. (2009). Can the swimming thrust of BCF biomimetics fish be enhanced? 2008 IEEE International Conference on Robotics and Biomimetics, ROBIO 2008, 437–442. https://doi.org/10.1109/ROBIO.2009.4913043",
    "id": "Chong_etal_2009",
    "group": "Robot"
  },
  {
    "name": "Carlton J, Aldwinkle J and Anderson J 2013 Future Ship Powering Options: Exploring Alternative Methods of Ship Propulsion (London: Royal Academy of Engineering)",
    "id": "Carlton_etal_2013",
    "group": "Misc"
  },
  {
    "name": "Du R, Li Z, Youcef-Toumi K and Valdivia y Alvarado P (ed) 2015 Robot Fish ( Springer Tracts in Mechanical Engineering) (Berlin: Springer)",
    "id": "Du_etal_2015",
    "group": "Robot"
  },
  {
    "name": "van Ginneken V, Antonissen E, Müller U K, Booms R, Eding E, Verreth J and van den Thillart G 2005 Eel migration to the sargasso: remarkably high swimming efficiency and low energy costs J. Exp. Biol. 208 1329–35",
    "id": "van_Ginneken_etal_2005",
    "group": "Fish"
  },
  {
    "name": "Vorus W S and Taravella B M 2011 Anguilliform fish propulsion of highest hydrodynamic efficiency J. Mar. Sci. Appl. 10 163",
    "id": "Vorus_Taravella_2011",
    "group": "Fish"
  },
  {
    "name": "Barrett D S 1988 Propulsive efficiency of robotuna PhD Thesis Massachusetts Institute of Technology",
    "id": "Barrett_1988",
    "group": "Robot"
  },
  {
    "name": "McIsaac K A and Ostrowski J P 2002 Experiments in closed- loop control for an underwater eel-like robot Proc. IEEE Int. Conf. on Robotics and Automation (Cat. No.02CH37292) (IEEE) vol 1 pp 750–5",
    "id": "McIsaac_Ostrowski_2002",
    "group": "Robot"
  },
  {
    "name": "Westphal A, Rulkov N F, Ayers J, Brady D and Hunt M 2011 Controlling a lamprey-based robot with an electronic nervous system Smart Struct. Syst. 8 39–52",
    "id": "Westphal_etal_2011",
    "group": "Robot"
  },
  {
    "name": "Stefanini C et al 2012 A novel autonomous, bioinspired swimming robot developed by neuroscientists and bioengineers Bioinspiration Biomimetics 7 025001",
    "id": "Stefanini_etal_2012",
    "group": "Robot"
  },
  {
    "name": "Liljeback P, Stavdahl O, Pettersen K Y and Gravdahl J T 2014 Mamba—a waterproof snake robot with tactile sensing In {IEEE}/{RSJ} Inte. Conf. on Intelligent Robots and Systems (Institute of Electrical & Electronics Engineers) (IEEE) (https://doi.org/10.1109/IROS.2014.6942575)",
    "id": "Liljeback_etal_2014",
    "group": "Robot"
  },
  {
    "name": "Crespi A, Badertscher A, Guignard A and Ijspeert A J 2005 AmphiBot I: an amphibious snake-like robot Robot. Auton. Syst. 50 163–75",
    "id": "Crespi_etal_2005",
    "group": "Robot"
  },
  {
    "name": "Crespi A and Ijspeert A J 2006 AmphiBot II: an amphibious snake robot that crawls and swims using a central pattern generator Int. Conf. Climbing and Walking Robots (CLAWAR 2006) pp 19–27",
    "id": "Crespi_Ijspeert_2006",
    "group": "Robot"
  },
  {
    "name": "Porez M, Boyer F and Ijspeert A J 2014 Improved Lighthill fish swimming model for bio-inspired robots: modeling, computational aspects and experimental comparisons Int. J. Robot. Res. 33 1322–41",
    "id": "Porez_etal_2014",
    "group": "Robot"
  },
  {
    "name": "Yu S, Ma S, Li B and Wang Y 2009 An amphibious snake-like robot: design and motion experiments on ground and in water Int. Conf. on Information and Automation (IEEE) pp 500–5",
    "id": "Yu_etal_2009",
    "group": "Robot"
  },
  {
    "name": "Manfredi L et al 2013 A bioinspired autonomous swimming robot as a tool for studying goal-directed locomotion Biol. Cybern. 107 513–27",
    "id": "Manfredi_etal_2014",
    "group": "Robot"
  },
  {
    "name": "Bayat B, Crespi A and Ijspeert A 2016 Envirobot: a bio- inspired environmental monitoring platform IEEE/OES Conf. Autonomous Underwater Vehicles (Tokyo, Japan) (https://doi. org/10.1109/AUV.2016.7778700)",
    "id": "Bayat_etal_2016",
    "group": "Robot"
  },
  {
    "name": "Williams T M 1989 Swimming by sea otters: adaptations for low energetic cost locomotion J. Comparative Physiol. A 164 815–24",
    "id": "Williams_1989",
    "group": "Misc"
  },
  {
    "name": "Nicolas G and Bideau B 2009 A kinematic and dynamic comparison of surface and underwater displacement in high level monofin swimming Hum. Mov. Sci. 28 480–93",
    "id": "Nicolas_Bideau_2009",
    "group": "Misc"
  },
  {
    "name": "Zarrouk D, Mann M, Degani N, Yehuda T, Jarbi N and Hess A 2016 Single actuator wave-like robot (SAW): design, modeling, and experiments Bioinspiration Biomimetics 11 046004",
    "id": "Zarrouk_etal_2016",
    "group": "Robot"
  },
  {
    "name": "Leftwich M C, Tytell E D, Cohen A H and Smits A J 2012 Wake structures behind a swimming robotic lamprey with a passively flexible tail J. Exp. Biol. 215 416–25",
    "id": "Leftwich_etal_2012",
    "group": "Robot"
  },
  {
    "name": "Maurya P, Aguiar A P and Pascoal A 2009 Marine vehicle path following using inner-outer loop control IFAC Proc. Volumes (8th IFAC Conf. on Manoeuvring and Control of Marine Craft) vol 42 pp 38–43",
    "id": "Maurya_etal_2009",
    "group": "Misc"
  },
  {
    "name": "Paschal T 2017 Undulatory swimming versus propeller based Technical Report BioRob, EPFL",
    "id": "Paschal_2017",
    "group": "Misc"
  },
  {
    "name": "Struebig, K., Bayat, B., Eckert, P., Looijestijn, A., Lueth, T. C., & Ijspeert, A. J. (2020). Design and development of the efficient anguilliform swimming robot-MAR. Bioinspiration and Biomimetics, 15(3), 035001. https://doi.org/10.1088/1748-3190/ab6be0",
    "id": "Struebig_etal_2020",
    "group": "Robot"
  },
  {
    "name": "Taylor, G. K., Nudds, R. L., and Thomas, A. L., 2003, “Flying and Swimming Animals Cruise at a Strouhal Number Tuned for High Power Efficiency,” Nature, 425(6959), pp. 707–711",
    "id": "Taylor_etal_2003",
    "group": "Fish"
  },
  {
    "name": "Lighthill, M. J., 2006, “Note on the Swimming of Slender Fish,” J. Fluid Mech., 9(2), p. 305",
    "id": "Lighthill_2006",
    "group": "Fish"
  },
  {
    "name": "Anderson, J. M., and Chhabra, N. K., 2002, “Maneuvering and Stability Per- formance of a Robotic Tuna,” Integr. Comp. Biol., 42(1), pp. 118–126.",
    "id": "Anderson_Chhabra_2002",
    "group": "Robot"
  },
  {
    "name": "Zhong, Y., Li, Z., and Du, R., 2018, “Robot Fish With Two-DOF Pectoral Fins and a Wire-Driven Caudal Fin,” Adv. Rob., 32(1), pp. 25–36",
    "id": "Zhong_etal_2018a",
    "group": "Robot"
  },
  {
    "name": "Liu, J., and Hu, H., 2010, “Biological Inspiration: From Carangiform Fish to Multi-Joint Robotic Fish,” J. Bionic Eng., 7(1), pp. 35–48",
    "id": "Liu_Hu_2010",
    "group": "Robot"
  },
  {
    "name": "y Alvarado, P. V., and Youcef-Toumi, K., 2003, “Modeling and Design Meth- odology of an Efficient Underwater Propulsion System,” Robotics and Applica- tions, Salzburg, Austria, June 25–27, pp. 161–166",
    "id": "y_Alvadaro_Youcef-Toumi_2003",
    "group": "Robot"
  },
  {
    "name": "Zhong, Y., Du, R., and Chiu, P. W., 2015, “Tadpole Endoscope: A Wireless Micro Robot Fish for Examining the Entire Gastrointestinal (GI) Tract,” HKIE Trans., 22(2), pp. 117–122",
    "id": "Zhong_etal_2003",
    "group": "Robot"
  },
  {
    "name": "Paxton, J. R., Eschmeyer, W. N., and Kirshner, D., 1998, Encyclopedia of Fishes, Academic Press, Singapore.",
    "id": "Paxton_etal_1998",
    "group": "Fish"
  },
  {
    "name": "Lauder, G. V., Anderson, E. J., Tangorra, J., and Madden, P. G., 2007, “Fish Biorobotics: Kinematics and Hydrodynamics of Self-Propulsion,” J. Exp. Biol., 210(Pt 16), pp. 2767–2780",
    "id": "Lauder_etal_2007",
    "group": "Robot"
  },
  {
    "name": "Anderson, J., Streitlien, K., Barrett, D., and Triantafyllou, M., 1998, “Oscillating Foils of High Propulsive Efficiency,” J. Fluid Mech., 360, pp. 41–72",
    "id": "Anderson_etal_1998",
    "group": "Robot"
  },
  {
    "name": "Wen, L., and Lauder, G., 2013, “Understanding Undulatory Locomotion in Fishes Using an Inertia-Compensated Flapping Foil Robotic Device,” Bioinspi- ration Biomimetics, 8(4), p. 046013",
    "id": "Wen_Lauder_2013",
    "group": "Robot"
  },
  {
    "name": "Zhong, Y., Song, J., Yu, H., and Du, R., 2018, “Towards a Transform Method From Lighthill Fish Swimming Model to Biomimetic Robot Fish,” IEEE Rob. Autom. Lett., 3(3), pp. 2632–2639.",
    "id": "Zhong_etal_2018b",
    "group": "Robot"
  },
  {
    "name": "Lauder, G. V., Lim, J., Shelton, R., Witt, C., Anderson, E., and Tangorra, J. L., 2011, “Robotic Models for Studying Undulatory Locomotion in Fishes,” Mar. Technol. Soc. J., 45(4), pp. 41–55.",
    "id": "Lauder_etal_2011",
    "group": "Robot"
  },
  {
    "name": "Wardle, C., Videler, J., and Altringham, J., 1995, “Tuning in to Fish Swimming Waves: Body Form, Swimming Mode and Muscle Function,” J. Exp. Biol., 198(Pt 8), pp. 1629–1636.",
    "id": "Wardler_etal_1995",
    "group": "Fish"
  },
  {
    "name": "Triantafyllou, M., Triantafyllou, G., and Yue, D., 2000, “Hydrodynamics of Fishlike Swimming,” Annu. Rev. Fluid Mech., 32(1), pp. 33–53",
    "id": "Triantafyllou_etal_2000",
    "group": "Fish"
  },
  {
    "name": "Lauder, G. V., and Tytell, E. D., 2005, “Hydrodynamics of Undulatory Propulsion,” Fish Physiol., 23, pp. 425–468",
    "id": "Lauder_Tytell_2005",
    "group": "Fish"
  },
  {
    "name": "Hover, F., Haugsdal, Ø., and Triantafyllou, M., 2004, “Effect of Angle of Attack Profiles in Flapping Foil Propulsion,” J. Fluids Struct., 19(1), pp. 37–47.",
    "id": "Hover_etal_2004",
    "group": "Robot"
  },
  {
    "name": "Lu, K., Xie, Y., and Zhang, D., 2013, “Numerical Study of Large Amplitude, Nonsinusoidal Motion and Camber Effects on Pitching Airfoil Propulsion,” J. Fluids Struct., 36, pp. 184–194",
    "id": "Lu_etal_2013",
    "group": "Robot"
  },
  {
    "name": "Long, J., Koob, T., Irving, K., Combie, K., Engel, V., Livingston, N., Lammert, A., and Schumacher, J., 2006, “Biomimetic Evolutionary Analysis: Testing the Adaptive Value of Vertebrate Tail Stiffness in Autonomous Swimming Robots,” J. Exp. Biol., 209(23), pp. 4732–4746",
    "id": "Long_etal_2006",
    "group": "Robot"
  },
  {
    "name": "Liu, J.-D., and Hu, H., 2006, “Biologically Inspired Behaviour Design for Autonomous Robotic Fish,” Int. J. Autom. Comput., 3(4), pp. 336–347.",
    "id": "Liu_Hu_2006",
    "group": "Robot"
  },
  {
    "name": "Zhong, Y., and Du, R., 2016, “Design and Implementation of a Novel Robot Fish With Active and Compliant Propulsion Mechanism,” Robotics: Science and Systems, Ann Arbor, MI, June 18–22, Paper No. 11",
    "id": "Zhong_Du_2016",
    "group": "Robot"
  },
  {
    "name": "Zhong, Y., and Du, R., 2016, “Parametric Study of the Swimming Performance of a Novel Robot Fish With Active Compliant Propulsion Mechanism,” ASME Paper No. DETC2016-60575",
    "id": "Zhong_Du_2016b",
    "group": "Robot"
  },
  {
    "name": "Zhong, Y., Li, Z., and Du, R., 2017, “A Novel Robot Fish With Wire-Driven Active Body and Compliant Tail,” IEEE/ASME Trans. Mechatronics, 22(4), pp. 1633–1643",
    "id": "Zhong_etal_2017",
    "group": "Robot"
  },
  {
    "name": "Newman, J., and Wu, T., 1973, “A Generalized Slender-Body Theory for Fish- like Forms,” J. Fluid Mech., 57(4), pp. 673–693",
    "id": "Newman_Wu_1973",
    "group": "Fish"
  },
  {
    "name": "Epps, B. P., Valdivia y Alvarado, P., Youcef-Toumi, K., and Techet, A. H., 2009, “Swimming Performance of a Biomimetic Compliant Fish-like Robot,” Exp. Fluids, 47(6), pp. 927–939.",
    "id": "Epps_etal_2009",
    "group": "Robot"
  },
  {
    "name": "Fossen, T. I., 1994, Guidance and Control of Ocean Vehicles, Wiley, New York",
    "id": "Fossen_1994",
    "group": "Misc"
  },
  {
    "name": "Hoerner, S. F., and Borst, H. V., 1985, Fluid-Dynamic Lift: Practical Informa- tion on Aerodynamic and Hydrodynamic Lift, Hoerner Fluid Dynamics, Van- couver, WA",
    "id": "Hoerner_Bost_1985",
    "group": "Misc"
  },
  {
    "name": "Pedley, T., and Hill, S., 1999, “Large-Amplitude Undulatory Fish Swimming: Fluid Mechanics Coupled to Internal Mechanics,” J. Exp. Biol., 202(23), pp. 3431–3438.",
    "id": "Pedley_Hill_1999",
    "group": "Fish"
  },
  {
    "name": "Journ?ee, J., and Massie, W., 2000, Offshore Hydromechanics, TU Delft, Delft, The Netherlands.",
    "id": "Journee_Massie_2000",
    "group": "Misc"
  },
  {
    "name": "Bainbridge, R., 1958, “The Speed of Swimming of Fish as Related to Size and to the Frequency and Amplitude of the Tail Beat,” J. Exp. Biol., 35(1), pp. 109–133.",
    "id": "Bainbridge_1958",
    "group": "Fish"
  },
  {
    "name": "Videler, J., and Wardle, C., 1991, “Fish Swimming Stride by Stride: Speed Limits and Endurance,” Rev. Fish Biol. Fisheries, 1(1), pp. 23–40",
    "id": "Videler_Wardle_1991",
    "group": "Fish"
  },
  {
    "name": "Kaya, M., and Tuncer, I. H., 2007, “Nonsinusoidal Path Optimization of a Flap- ping Airfoil,” AIAA J., 45(8), pp. 2075–2082.",
    "id": "Kaya_Tuncer_2007",
    "group": "Robot"
  },
  {
    "name": "Clapham, R. J., and Hu, H., 2015, “iSplash: Realizing Fast Carangiform Swim- ming to Outperform a Real Fish,” Robot Fish, Springer, Berlin, pp. 193–218.",
    "id": "Clapham_Hu_2015",
    "group": "Robot"
  },
  {
    "name": "El Daou, H., Salumae, T., Chambers, L. D., Megill, W. M., and Kruusmaa, M., 2014, “Modelling of a Biologically Inspired Robotic Fish Driven by Compliant Parts,” Bioinspiration Biomimetics, 9(1), p. 016010.",
    "id": "El_Daou_etal_2014",
    "group": "Robot"
  },
  {
    "name": "Chowdhury, A. R., Kumar, V., Prasad, B., Kumar, R., and Panda, S., 2014, “Model-Based Control of a Bcf Mode Carangiform Bioinspired Robotic Fish,” Mar. Technol. Soc. J., 48(4), pp. 36–50",
    "id": "Chowdhury_etal_2014",
    "group": "Robot"
  },
  {
    "name": "Anderson, E. J., Mcgillis, W. R., and Grosenbaugh, M. A., 2001, “The Bound- ary Layer of Swimming Fish,” J. Exp. Biol., 204(Pt 1), pp. 81–102.",
    "id": "Anderson_etal_2001",
    "group": "Fish"
  },
  {
    "name": "Tytell, E. D., 2004, “Kinematics and Hydrodynamics of Linear Acceleration in Eels, Anguilla Rostrata,” Proc. R. Soc. London B: Biol. Sci., 271(1557), pp. 2535–2540.",
    "id": "Tytell_2004",
    "group": "Fish"
  },
  {
    "name": "Zhong, Y., Song, J., Yu, H., & Du, R. (2018). A study on kinematic pattern of fish undulatory locomotion using a robot fish. Journal of Mechanisms and Robotics, 10(4), 041013–1. https://doi.org/10.1115/1.4040434",
    "id": "Zhong_etal_2018c",
    "group": "Robot"
  },
  {
    "name": "K. Streitlien, G. S. Triantafyllou, and M. S. Triantafyllou, “Efficient foil propulsion through vortex control,” AIAA Journal, Vol. 34, 1996, pages 2315–2319",
    "id": "Streitlien_etal_1996",
    "group": "Robot"
  },
  {
    "name": "S. Guo, T. Fukuda, Norihiko KATO, Keisuke OGURO. “Development of Underwater Microrobot Using ICPF Actuator”. Proceedings of the IEEE International Conference on Robotics and Automation, May 1998, pages 1829-1834.",
    "id": "Guo_etal_1998",
    "group": "Robot"
  },
  {
    "name": "J.J. Videler, “Fish Swimming”, London, UK: Chapman & Hall.1993. pages 121.",
    "id": "Videler_1993",
    "group": "Fish"
  },
  {
    "name": "Igor L. Y. Spierts, Johan L. Van Leeuwen. “Kinematics and muscle dynamics of C- and S-starts of carp(syprinus carpio L.)”. Journal of Experimental Biology, 202, 1999, pages 393-406",
    "id": "Igor_etal_1999",
    "group": "Fish"
  },
  {
    "name": "J. Liu and H. Hu, Building a 3D Simulator for Autonomous Navigation of Robotic Fishes, Proceedings of IEEE/RSJ Int. Conf. on Intelligent Robots and Systems, Sendai International Centre, Sendai, Japan, 28 Sept. - 2 Oct. 2004, pages 613-618",
    "id": "Liu_Hu_2004",
    "group": "Robot"
  },
  {
    "name": "J.Z. Yu, etc. A simplified Propulsive Model of Biomimetic Robot Fish and Its Realization. IEEE Transactions on Systems, Man and Cybernetics Part B: Cybernetics, Vol. 34, No. 4, 2004, pages 1798- 1810",
    "id": "Yu_etal_2004b",
    "group": "Robot"
  },
  {
    "name": "E.G. Drucker and G.V. Lauder. Wake dynamics and fluid forces of turning maneuvers in sunfish. Journal of Experimental Biology, 204, 2001, pages 431-442",
    "id": "Drucker_Lauder_2001",
    "group": "Fish"
  },
  {
    "name": "Liu, J., & Hu, H. (2005). Mimicry of Sharp Turning Behaviours in a Robotic Fish. Proceedings of the 2005 IEEE International Conference on Robotics and Automation Barcelona, Spain, April 2005.",
    "id": "Liu_Hu_2005",
    "group": "Robot"
  },
  {
    "name": "J. Yu, L. Wang and M. Tan, Geometric optimization of relative link lengths for biomimetic robotic fish, IEEE Trans. Robot. 23 (2007) 382–386",
    "id": "Yu_etal_2007",
    "group": "Robot"
  },
  {
    "name": "C. Zhou, M. Tan, Z. Cao, S. Wang, D. Creighton, N. Gu and S. Nahavandi, Kinematic modeling of a bio-inspired robotic fish, IEEE Int. Conf. Robotics and Automation, 2008. ICRA 2008, May 2008, pp. 695–699.",
    "id": "Zhou_etal_2008",
    "group": "Robot"
  },
  {
    "name": "Y. Zhang, J. He and K. H. Low, Parametric study of an underwater finned propulsor inspired by bluespotted ray, J. Bionic Eng. 9 (2012) 166–176",
    "id": "Zhang_etal_2012",
    "group": "Robot"
  },
  {
    "name": "Y. Zhang, J. He and G. Zhang, Measurement on morphology and ki- nematics of crucian vertebral joints, J. Bionic Eng. 8 (2011) 10–17.",
    "id": "Zhang_etal_2011",
    "group": "Fish"
  },
  {
    "name": "P. L. Nguyen, V. P. Do and B. R. Lee, Dynamic modeling and experi- ment of a fish robot with a flexible tail fin, J. Bionic Eng. 10 (2013) 39–45",
    "id": "Nguyen_etal_2013",
    "group": "Fish"
  },
  {
    "name": "M. J. Lighthill, Aquatic animal propulsion of high hydromechanical efficiency, J. Fluid Mech. 44 (1970) 265–301",
    "id": "Lighthill_1970",
    "group": "Fish"
  },
  {
    "name": "M. J. Lighthill, Large-amplitude elongated-body theory of fish loco- motion, Proc. R. Soc. Lond. B, Biol. Sci. 179 (1055) (1971) 125–138",
    "id": "Lighthill_1971",
    "group": "Fish"
  },
  {
    "name": "J. Z. Yu, M. Tan, S. Wang and E. Chen, Development of a biomimetic robotic fish and its control algorithm, IEEE Trans. Syst., Man, Cybern. B, Cybern. 34 (2004) 1798–1810",
    "id": "Yu_etal_2004",
    "group": "Robot"
  },
  {
    "name": "K. A. Morgansen, V. Duidam, R. J. Mason, J. W. Burdick and R. M. Murray, Nonlinear control methods for planar carangiform robot fish locomotion, in IEEE Int. Conf. Robotics and Automation, 2001. Proc. 2001 ICRA, Vol. 1 (2001), pp. 427–434",
    "id": "Morgansen_etal_2001",
    "group": "Robot"
  },
  {
    "name": "K. A. Morgansen, P. A. Vela and J. W. Burdick, Trajectory stabilization for a planar carangiform robot fish, in IEEE Int. Conf. Robotics and Automation, 2002. Proc. ICRA'02, Vol. 1 (2002), pp. 756–762.",
    "id": "Morgansen_etal_2002",
    "group": "Robot"
  },
  {
    "name": "K. A. Morgansen, B. I. Triplett and D. J. Klein, Geometric methods for modeling and control of free-swimming fin-actuated underwater vehicles, IEEE Trans. Robot. 23 (2007) 1184–1199",
    "id": "Morgansen_etal_2007",
    "group": "Robot"
  },
  {
    "name": "F. Boyer, M. Porez and W. Khalil, Macro-continuous computed torque algorithm for a three-dimensional eel-like robot, IEEE Trans. Robot. 22 (2006) 763–775.",
    "id": "Boyger_etal_2006",
    "group": "Robot"
  },
  {
    "name": "M. Sfakiotakis and D. P. Tsakiris, Biomimetic centering for undulatory robots, Int. J. Robot. Res. 26 (2007) 1267–1282.",
    "id": "Sfakiotakis_Tsakiris_2007",
    "group": "Robot"
  },
  {
    "name": "J. Yu, L. Wang, J. Shao and M. Tan, Control and coordination of multiple biomimetic robotic fish, IEEE Trans. Control Syst. Tech. 15(1) (2007) 176–183.",
    "id": "Yu_etal_2007b",
    "group": "Robot"
  },
  {
    "name": "Z. Su, J. Yu, M. Tan and J. Zhang, Closed-loop precise turning control for a bcf-mode robotic fish, 2010 IEEE/RSJ Int. Conf. Intelligent Robots and Systems (IROS) (2010), pp. 946–951",
    "id": "Su_etal_2010",
    "group": "Robot"
  },
  {
    "name": "J. Yu, M. Wang, Z. Su, M. Tan and J. Zhang, Dynamic modeling and its application for a cpg-coupled robotic fish, 2011 IEEE Int. Conf. Robotics and Automation (ICRA), 2011, pp. 159–164",
    "id": "Yu_etal_2011",
    "group": "Robot"
  },
  {
    "name": "K. A. McIsaac and J. P. Ostrowski, Open-loop verification of motion planning for an underwater eel-like robot, 7th Int. Symp. Experi- mental Robotics,11–13 December, 2000, pp. 271–280",
    "id": "McIsaac_Ostrowski_2000",
    "group": "Robot"
  },
  {
    "name": "J. Yu, L. Liu, L. Wang, M. Tan and D. Xu, Turning control of a multilink biomimetic robotic fish, IEEE Trans. Robot. 24 (2008) 201–206",
    "id": "Yu_etal_2008",
    "group": "Robot"
  },
  {
    "name": "K. H. Low, C. Zhou and Y. Zhong, Gait planning for steady swimming control of biomimetic fish robots, Adv. Robot. 23(7–8) (2009) 805– 829.",
    "id": "Low_etal_2009",
    "group": "Robot"
  },
  {
    "name": "K. A. McIsaac and J. P. Ostrowski, Motion planning for anguilliform locomotion, IEEE Trans. Robot. Autom. 19 (2003) 637–652.",
    "id": "McIsaac_Ostrowski_2003",
    "group": "Fish"
  },
  {
    "name": "A. J. Ijspeert, Central pattern generators for locomotion control in animals and robots: A review, Neural Netw. 21 (2008) 642–653.",
    "id": "Ijspeet_2008",
    "group": "Robot"
  },
  {
    "name": "J. Colgate and K. Lynch, Mechanics and control of swimming: A re- view, IEEE J. Ocean. Eng. 29 (2004) 660–673",
    "id": "Colgate_Lynch_2004",
    "group": "Fish"
  },
  {
    "name": "J. J. Craig Introduction to Robotics: Mechanics and Control (Addison- Wesley Longman Publishing Co., Inc., Boston, MA, USA, 1989).",
    "id": "Craig_1989",
    "group": "Robot"
  },
  {
    "name": "Y.-L. Yang, P. Chao and C.-K. Sung, Landing posture control for a generalized twin-body system using methods of inputcoutput line- arization and computed torque, IEEE/ASME Trans. Mechatronics 14(3) (2009) 326–336",
    "id": "Yang_Sung_2009",
    "group": "Misc"
  },
  {
    "name": "J. Slotine and W. Li, Applied Nonlinear Control (Prentice Hall, 1991",
    "id": "Slotine_Li_1991",
    "group": "Misc"
  },
  {
    "name": "W. Cao and J. Xu, Nonlinear integral-type sliding surface for both matched and unmatched uncertain systems, IEEE Trans. Autom. Control 49 (2004) 1355–1360.",
    "id": "Cao_Xu_2004",
    "group": "Misc"
  },
  {
    "name": "A. Smith, F. Mobasser and K. Hashtrudi-Zaad, Neural-network-based contact force observers for haptic applications, IEEE Trans. Robot. 22 (2006) 1163–1175",
    "id": "Smith_etal_2006",
    "group": "Misc"
  },
  {
    "name": "F. Hoppensteadt and E. Izhikevich, Weakly Connected Neural Net- works, Applied Mathematical Sciences, No. 126 (Springer, 1997)",
    "id": "Hoppensteadt_Izhikevich_1997",
    "group": "Misc"
  },
  {
    "name": "J. Yu, M. Wang, W. Wang, M. Tan and J. Zhang, Design and control of a fish-inspired multimodal swimming robot, 2011 IEEE Int. Conf. Ro- botics and Automation (ICRA), May 2011, pp. 3664–3669",
    "id": "Yu_etal_2011b",
    "group": "Robot"
  },
  {
    "name": "K. Seo, S.-J. Chung and J.-J. E. Slotine, CPG-based control of a turtle- like underwater vehicle, Autonom. Robots 28 (2010) 247–269",
    "id": "Keo_etal_2010",
    "group": "Robot"
  },
  {
    "name": "Y. Hu, W. Tian, J. Liang and T. Wang, Learning fish-like swimming with a cpg-based locomotion controller, 2011 IEEE/RSJ Int. Conf. Intelligent Robots and Systems (IROS), Septmeber 2011, pp. 1863– 1868",
    "id": "Hu_etal_2011",
    "group": "Robot"
  },
  {
    "name": "A. Crespi and A. Ijspeert, Online optimization of swimming and crawling in an amphibious snake robot, IEEE Trans. Robot. 24 (2008) 75–87",
    "id": "Crespi_Ijspeert_2008",
    "group": "Robot"
  },
  {
    "name": "J.-X. Xu and W. Wang, A general internal model approach for motion learning, IEEE Trans. Syst., Man, Cybern. B, Cybern. 38 (2008) 477– 487",
    "id": "Xu_Wang_2008",
    "group": "Misc"
  },
  {
    "name": "K. D'Aout and P. Aerts, A kinematic comparison of forward and backward swimming in the eel Anguilla anguilla, J. Exp. Biol. 202 (1999) 1511–1521",
    "id": "DAout_Aerts_1999",
    "group": "Fish"
  },
  {
    "name": "Niu, X., & Xu, J. (2014). Modeling, Control and Locomotion Planning of an Anguilliform Robotic Fish. Unmanned Systems, 02(04), 295–321. http://www.worldscientific.com/doi/abs/10.1142/S230138501440007X",
    "id": "Niu_Xu_2014",
    "group": "Robot"
  }
]